# IFCGuidKey Methods

---
The IFCGuidKey type exposes the following members.
| Name| Description
---|---|---
| Dispose|
| Equals|  Determines whether this IFCGuidKey is equal to another. (Overrides ObjectEquals(Object))
| GetHashCode|  Returns the hash code for this IFCGuidKey (Overrides ObjectGetHashCode)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace